package main

import "fmt"

func main() {
	fmt.Println(2 & 3)
	//2[10]
	//3[11]
	//2

	fmt.Println(2 | 3)
	//2[10]
	//3[11]
	//3

	fmt.Println(13 & 7)
	//13[1101]
	//7[0111]
	//5[0101]

	fmt.Println(5 | 4)
	//5[0101]
	//4[0100]
	//5

	fmt.Println(-3 ^ 3)
	//负数的反码 符号位不变 其他取反
	//负数的补码 反码+1
	//-3 原码[1000 0011] 反码[1111 1100] 补码[1111 1101]
	//3 原码[0000 0011] 反码[0000 0011] 补码[0000 0011]
	//	补码[1111 1110] 反码[1111 1101] 原码[1000 0010] -2

	fmt.Println(-2 ^ 2)
	//-2 原码[1000 0010] 反码[1111 1101] 补码[1111 1110]
	//2  原码[0000 0010] 反码[0000 0010] 补码[0000 0010]
	//补码[1111 1100] 反码[1111 1011] 原码[1000 0100] -4
}
